* xg480_phy 25g/10g verification todo [71%]
** TODO The rate_meter_multiple issues [%]
*** TODO Line side rate_meter_rx trigger mac_tx send out the pause; the interval isn't correct.
    - State "TODO"       from "WAITING"    [2018-05-30 Wed 11:25]
rate_meter_multiple has bug, the interval of ON type pause is so closed. it's 200us, the expect value is 2ms.
*** TODO Line side mac_tx port shaper function test based on rate_meter_multiple
    - State "TODO"       from "WAITING"    [2018-05-30 Wed 11:25]
mac_tx has not implement it
** DONE Port based lookback testcase updating [100%]
   CLOSED: [2018-06-06 Wed 14:52]
   - State "DONE"       from "STARTED"    [2018-06-06 Wed 14:52]
   :LOGBOOK:  
   CLOCK: [2018-06-06 Wed 14:26]--[2018-06-06 Wed 14:52] =>  0:26
   :END:      
*** DONE tc_300
    CLOSED: [2018-06-06 Wed 14:08]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 14:08]
    :LOGBOOK:  
    CLOCK: [2018-06-06 Wed 12:17]--[2018-06-06 Wed 12:22] =>  0:05
    :END:      
*** DONE tc_300_lab
    CLOSED: [2018-06-06 Wed 14:10]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 14:10]
    :LOGBOOK:  
    CLOCK: [2018-06-06 Wed 14:08]--[2018-06-06 Wed 14:10] =>  0:02
    :END:      
*** DONE tc_301
    CLOSED: [2018-06-06 Wed 14:24]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 14:24]
    :LOGBOOK:  
    CLOCK: [2018-06-06 Wed 14:10]--[2018-06-06 Wed 14:24] =>  0:14
    :END:      
** DONE vlan_det_lookup device level test. [83%]
   CLOSED: [2018-06-06 Wed 17:42]
   - State "DONE"       from "STARTED"    [2018-06-06 Wed 17:42]
   - State "STARTED"    from "DONE"       [2018-06-06 Wed 12:12]
   - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:57]
   :LOGBOOK:  
   CLOCK: [2018-06-06 Wed 17:38]--[2018-06-06 Wed 17:42] =>  0:04
   CLOCK: [2018-05-30 Wed 12:20]--[2018-05-30 Wed 12:21] =>  0:01
   CLOCK: [2018-05-30 Wed 12:13]--[2018-05-30 Wed 12:14] =>  0:01
   CLOCK: [2018-05-30 Wed 11:51]--[2018-05-30 Wed 11:59] =>  0:08
   CLOCK: [2018-05-30 Wed 11:32]--[2018-05-30 Wed 11:49] =>  0:17
   :END:      
*** DONE tb_env support
    CLOSED: [2018-05-30 Wed 16:13]
    - State "DONE"       from "TODO"       [2018-05-30 Wed 16:13]
*** DONE transfer function support: lpbk_y1564_det transfer funciton instance the vlan_det_lookup TF.
    CLOSED: [2018-05-30 Wed 16:13]
    - State "DONE"       from "TODO"       [2018-05-30 Wed 16:13]
*** DONE testcase setup [100%]
    CLOSED: [2018-06-06 Wed 12:11]
    - State "DONE"       from "TODO"       [2018-06-06 Wed 12:11]
    - State "TODO"       from "DONE"       [2018-06-06 Wed 12:11]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:56]
**** DONE tc_302 [100%]
     CLOSED: [2018-06-06 Wed 11:56]
     - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:56]
     - State "STARTED"    from "DONE"       [2018-05-31 Thu 17:21]
     - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:23]
     :LOGBOOK:  
     CLOCK: [2018-05-31 Thu 17:21]--[2018-05-31 Thu 17:22] =>  0:01
     CLOCK: [2018-05-31 Thu 16:01]--[2018-05-31 Thu 16:09] =>  0:08
     CLOCK: [2018-05-31 Thu 15:54]--[2018-05-31 Thu 15:57] =>  0:03
     CLOCK: [2018-05-31 Thu 15:38]--[2018-05-31 Thu 15:43] =>  0:05
     CLOCK: [2018-05-31 Thu 14:50]--[2018-05-31 Thu 15:20] =>  0:30
     CLOCK: [2018-05-31 Thu 09:45]--[2018-05-31 Thu 09:46] =>  0:01
     CLOCK: [2018-05-30 Wed 17:32]--[2018-05-30 Wed 17:38] =>  0:06
     CLOCK: [2018-05-30 Wed 17:08]--[2018-05-30 Wed 17:16] =>  0:08
     CLOCK: [2018-05-30 Wed 16:23]--[2018-05-30 Wed 16:27] =>  0:04
     :END:      
***** DONE flow based fac loopback by vlan_det_lookup; disable port based loop, provisioning only 1 matchId(63)
      CLOSED: [2018-05-31 Thu 17:22]
      - State "DONE"       from "TODO"       [2018-05-31 Thu 17:22]
       change the mac_rx_4.sv to every segment send request to vlan_det module; there are 2 flows did not loopback, need Jimmy to double check DUT.<2018-05-30 Wed 17:42> 
       the vlan_det_lookup moudle has bug. Bob is working on it. <2018-05-31 Thu 09:45> 
       Add 2 parameter to LINE 257 in main_clock.sv, they are REF_JITTER1(0.0) REF_JITTER2(0.0), Re-run tc_302, then check the result again. Bob found the issue is caused by the clock's phase. <2018-05-31 Thu 15:10>; copy the wave to vsim_jitter_set_0.wlf, result is pass !?
       Haidong advice that changing the CLKFBOUT_MULT_F form 63.000 to 64.000, re-run again.<2018-05-31 Thu 15:42>; copy the wave to vsim_just_clkfb_set_64.wlf, result is pass!?
       Return the all modification of main_clock, is re-running.<2018-05-31 Thu 15:57> the result is pass, cannot re-produce th issus?!
***** DONE more traffic input to lookup based on matchId 63. 
      CLOSED: [2018-06-01 Fri 09:26]
      - State "DONE"       from "STARTED"    [2018-06-01 Fri 09:26]
      - State "STARTED"    from "DONE"       [2018-06-01 Fri 09:25]
      - State "DONE"       from "STARTED"    [2018-05-31 Thu 18:11]
      :LOGBOOK:  
      CLOCK: [2018-06-01 Fri 09:25]--[2018-06-01 Fri 09:26] =>  0:01
      CLOCK: [2018-05-31 Thu 18:00]--[2018-05-31 Thu 18:11] =>  0:11
      CLOCK: [2018-05-31 Thu 17:43]--[2018-05-31 Thu 17:48] =>  0:05
      CLOCK: [2018-05-31 Thu 17:23]--[2018-05-31 Thu 17:41] =>  0:18
      :END:      
      phy1 input 51 flows, flow11--flow20 are untagged l2cp frame, they are exception. others will do flow based loopback.
***** DONE more matchId provisioning.
      CLOSED: [2018-06-06 Wed 11:56]
      - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:56]
      :LOGBOOK:  
      CLOCK: [2018-06-06 Wed 11:49]--[2018-06-06 Wed 11:56] =>  0:07
      CLOCK: [2018-06-06 Wed 11:19]--[2018-06-06 Wed 11:37] =>  0:18
      CLOCK: [2018-06-06 Wed 10:06]--[2018-06-06 Wed 10:30] =>  0:24
      CLOCK: [2018-06-06 Wed 09:02]--[2018-06-06 Wed 09:11] =>  0:09
      CLOCK: [2018-06-06 Wed 08:36]--[2018-06-06 Wed 08:53] =>  0:17
      CLOCK: [2018-06-05 Tue 18:32]--[2018-06-05 Tue 19:09] =>  0:37
      CLOCK: [2018-06-05 Tue 17:38]--[2018-06-05 Tue 18:14] =>  0:36
      CLOCK: [2018-06-05 Tue 16:51]--[2018-06-05 Tue 17:28] =>  0:37
      CLOCK: [2018-06-05 Tue 16:28]--[2018-06-05 Tue 16:42] =>  0:14
      CLOCK: [2018-06-05 Tue 15:48]--[2018-06-05 Tue 16:02] =>  0:14
      CLOCK: [2018-06-05 Tue 15:43]--[2018-06-05 Tue 15:45] =>  0:02
      CLOCK: [2018-06-05 Tue 14:30]--[2018-06-05 Tue 14:40] =>  0:10
      CLOCK: [2018-06-05 Tue 12:21]--[2018-06-05 Tue 12:23] =>  0:02
      CLOCK: [2018-06-05 Tue 12:08]--[2018-06-05 Tue 12:16] =>  0:08
      CLOCK: [2018-06-05 Tue 11:56]--[2018-06-05 Tue 12:00] =>  0:04
      CLOCK: [2018-06-05 Tue 11:23]--[2018-06-05 Tue 11:39] =>  0:16
      CLOCK: [2018-06-05 Tue 09:23]--[2018-06-05 Tue 09:32] =>  0:09
      CLOCK: [2018-06-05 Tue 09:00]--[2018-06-05 Tue 09:12] =>  0:12
      CLOCK: [2018-06-01 Fri 18:20]--[2018-06-01 Fri 18:26] =>  0:06
      CLOCK: [2018-06-01 Fri 17:56]--[2018-06-01 Fri 18:01] =>  0:05
      CLOCK: [2018-06-01 Fri 17:12]--[2018-06-01 Fri 17:44] =>  0:32
      CLOCK: [2018-06-01 Fri 16:19]--[2018-06-01 Fri 17:06] =>  0:47
      CLOCK: [2018-06-01 Fri 16:06]--[2018-06-01 Fri 16:11] =>  0:05
      CLOCK: [2018-06-01 Fri 14:22]--[2018-06-01 Fri 14:40] =>  0:18
      CLOCK: [2018-06-01 Fri 11:54]--[2018-06-01 Fri 12:28] =>  0:34
      CLOCK: [2018-06-01 Fri 11:53]--[2018-06-01 Fri 11:54] =>  0:01
      :END:      
      every port have flow based loopback.[[file:xg480_phy_verify_notes.org::tc_302a][tc_302a]]  
      every port have flow based loopback.[[file:xg480_phy_verify_notes.org::tc_302b][tc_302b]]  
***** TODO tc_302b fail, need desinger to debug.
*** DONE re-run tc_302 on 10g device TB
     CLOSED: [2018-05-31 Thu 16:45]
     - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:45]
     :LOGBOOK:  
     CLOCK: [2018-05-31 Thu 16:36]--[2018-05-31 Thu 16:43] =>  0:07
     CLOCK: [2018-05-31 Thu 16:24]--[2018-05-31 Thu 16:32] =>  0:08
     :END:      
     it's pass. need add more traffic flows, to generate more condiction to run this case
*** DONE align the testcase from 25g device to 10g device [100%]
    CLOSED: [2018-05-30 Wed 17:06]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 17:06]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 16:47]--[2018-05-30 Wed 17:03] =>  0:16
    :END:      
    - [X] tc_302
*** TODO full flows loopback test.[0%]
    - [ ] 64 flows do fac loop, term loop, y1564 co-exist on the same port
    - [ ] 64 flows on different ports.
** TODO port_process_ingress/port_process_egress (afp+pcp) test. [0%]
the spec has been ready, RTL has not been ready.
*** TODO provisioning method
*** TODO transfer function
*** TODO testcase [0/2]
    - [ ] ingress
    - [ ] egress
** DONE 100g PTP [100%]
   CLOSED: [2018-06-06 Wed 15:00]
   - State "DONE"       from "TODO"       [2018-06-06 Wed 15:00]
*** DONE testcase setup [100%]
    CLOSED: [2018-06-06 Wed 15:00]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 15:00]
    - State "STARTED"    from "DONE"       [2018-06-06 Wed 12:13]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:56]
    :LOGBOOK:  
    CLOCK: [2018-06-06 Wed 11:39]--[2018-06-06 Wed 11:49] =>  0:10
    CLOCK: [2018-06-06 Wed 09:59]--[2018-06-06 Wed 10:04] =>  0:05
    CLOCK: [2018-06-06 Wed 09:23]--[2018-06-06 Wed 09:53] =>  0:30
    CLOCK: [2018-06-06 Wed 08:59]--[2018-06-06 Wed 09:02] =>  0:03
    :END:      
    - [X] [[file:xg480_phy_verify_notes.org::tc_507][tc_507]], based tc_007 and tc_500, 100G mode ptp testcase
** DONE 100g CGMII interface [100%]
   CLOSED: [2018-06-15 Fri 18:02]
   - State "DONE"       from "STARTED"    [2018-06-15 Fri 18:02]
   :LOGBOOK:  
   CLOCK: [2018-06-14 Thu 11:10]--[2018-06-14 Thu 14:00] =>  2:50
   :END:      
   integrating the cgmii driver/monitor into TB/TB_ENV
*** DONE CGMII Monitor [100%]
    CLOSED: [2018-06-13 Wed 11:38]
    - State "DONE"       from "STARTED"    [2018-06-13 Wed 11:38]
    :LOGBOOK:  
    CLOCK: [2018-06-05 Tue 16:02]--[2018-06-05 Tue 16:05] =>  0:03
    CLOCK: [2018-06-05 Tue 14:52]--[2018-06-05 Tue 14:53] =>  0:01
    CLOCK: [2018-06-05 Tue 14:40]--[2018-06-05 Tue 14:45] =>  0:05
    CLOCK: [2018-06-05 Tue 12:16]--[2018-06-05 Tue 12:21] =>  0:05
    CLOCK: [2018-06-05 Tue 12:02]--[2018-06-05 Tue 12:08] =>  0:06
    :END:      
    - [X] CGMII RX SPEC and RTL [2/2]
      - [X] SPEC: the SPEC has been ready, Leo committed it.<2018-05-30 Wed> 
      - [X] RTL: it has been ready <2018-05-30 Wed> 
    - [X] UVM monitor 
*** DONE CGMII Driver [100%]
    CLOSED: [2018-06-13 Wed 11:38]
    - State "DONE"       from "STARTED"    [2018-06-13 Wed 11:38]
    :LOGBOOK:  
    CLOCK: [2018-06-13 Wed 10:55]--[2018-06-13 Wed 11:38] =>  0:43
    CLOCK: [2018-06-13 Wed 09:29]--[2018-06-13 Wed 09:47] =>  0:18
    CLOCK: [2018-06-07 Thu 10:22]--[2018-06-07 Thu 11:29] =>  1:07
    CLOCK: [2018-06-07 Thu 09:38]--[2018-06-07 Thu 10:02] =>  0:24
    CLOCK: [2018-06-07 Thu 09:01]--[2018-06-07 Thu 09:26] =>  0:25
    CLOCK: [2018-06-06 Wed 16:44]--[2018-06-06 Wed 16:59] =>  0:15
    CLOCK: [2018-06-06 Wed 15:17]--[2018-06-06 Wed 15:25] =>  0:08
    CLOCK: [2018-06-05 Tue 17:33]--[2018-06-05 Tue 17:38] =>  0:05
    CLOCK: [2018-06-05 Tue 16:42]--[2018-06-05 Tue 16:51] =>  0:09
    CLOCK: [2018-06-05 Tue 16:21]--[2018-06-05 Tue 16:28] =>  0:07
    CLOCK: [2018-06-05 Tue 16:05]--[2018-06-05 Tue 16:15] =>  0:10
    :END:      
    - [X] CGMII TX [2/2]
      - [X] SPEC
      - [X] RTL
    - [X] UVM Driver 
** CANCELLED y1564 feature test.
   CLOSED: [2018-05-31 Thu 18:23]
*** TODO monitor, Lance work on it.
*** TODO generator, Lance work on it.
** TODO Reserved Pin on DUT's top test [%]
*** TODO update tc_1000 [0/5]
**** TODO sgmii east/west backpressure out/in pin.
sgmiiEastRxBackpressureOut,
sgmiiEastTxBackpressureIn,
sgmiiWestRxBackpressureOut,
sgmiiWestTxBackpressureIn
In top.sv connect the output to input, then write the internal register with 1/0, read the input indication register.
**** TODO gasicParityInOut, gasicParityErrOut
input         gasicParityInOut  ,
input  logic  gasicParityErrOut , // change to input for pin test
Set those two signal 1/0, read the related indication register on device reg.
**** TODO SFP reserve pin
   input    logic [7:0]          sfpPresentIn_n             ,
   input    logic [7:0]          sfpLosIn                   ,
   input    logic [7:0]          sfpTxFaultIn               ,
   output   logic [7:0]          sfpTxDisableOut            ,
   output   logic [7:0]          sfpModuleSelOut            ,
   output   logic [7:0]          sfpLowPowerModeOut         ,
For input signal, set them to 1/0, read related indication register on device reg.
For output signal, write the related regiset on device reg, check/monitor the signal on top.sv/TB.
**** TODO cpldInOut
   input          [3:0]          cpldInOut                  ,     // Only cpldInOut[1:0] valid in HW connection
Input signal, set them to 1/0, read related indication register on device reg.
*** TODO update tc_500c [%]
**** TODO ptpClkCompensate In/out
    input    logic                ptpClkCompensateIn         ,
    output   logic                ptpClkCompensateOut        ,
In top.sv, connect the output to input, read the address 0x0c bit8 on ptp_server module. the value is 1, then change to 0.
**** TODO ptpMicroSemiLoadSave
   input    logic [1:0]          ptpMicroSemiLoadSaveInP    ,
   input    logic [1:0]          ptpMicroSemiLoadSaveInN    ,

   input    logic                clockSynce25In             ,
Read the register on ptp_server module.
*** TODO irqOut
   output   logic                irqOut_n                   ,
has not test, How to test?/!
*** TODO rxClkSelOut
   output   logic [5:0]          rxClkSelOut                ,
10G mode, 156.25Mhz
25G mode, 390.625Mhz
100G mode, 322.625Mhz
1G mode, 125Mhz
Config clock sel, enable and divider factor by register, then check/monitor the output clock's frequency.
*** TODO dyingGaspIn
   input    logic                dyingGaspIn                ,
add it to dyinggasp generation testcase. keep internal register trigger as 0, change it value form 0 to 1 (on top.sv) 5 times, the expected result is 5 times dying gasp frame generated.
** STARTED update tc_500b for egress, add TC RT. [0%]
*** STARTED update the ptp_editor's provisioning method
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 17:51]--[2018-05-31 Thu 17:59] =>  0:08
    :END:      
*** TODO update the testcase.
** DONE PTP full bandwidth. [100%]
   CLOSED: [2018-05-30 Wed 19:24]
   - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:24]
   :LOGBOOK:  
   CLOCK: [2018-05-30 Wed 14:49]--[2018-05-30 Wed 15:08] =>  0:19
   :END:      
*** DONE tc_503 All port input PTP packet with full bandwidth.[100%] 
    CLOSED: [2018-05-30 Wed 19:00]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:00]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 18:32]--[2018-05-30 Wed 18:59] =>  0:27
    CLOCK: [2018-05-30 Wed 18:01]--[2018-05-30 Wed 18:06] =>  0:05
    CLOCK: [2018-05-30 Wed 17:23]--[2018-05-30 Wed 17:31] =>  0:08
    :END:      
    - [X] all inress port input full bandwith traffic with PTP packet.<2018-05-30 Wed 18:59> 
**** DONE TF side need double check.<2018-05-30 Wed 19:26> 
     CLOSED: [2018-05-31 Thu 09:43]
     - State "DONE"       from "STARTED"    [2018-05-31 Thu 09:43]
     :LOGBOOK:  
     CLOCK: [2018-05-31 Thu 09:38]--[2018-05-31 Thu 09:43] =>  0:05
     CLOCK: [2018-05-31 Thu 08:32]--[2018-05-31 Thu 09:21] =>  0:49
     :END:      
    - [X] all egress port input full bandwith traffic with PTP packet, disable overwrite SA on mac_tx.
     when set every flow input 400 packets, there are miscmp errors; Need Tonny to double check it. <2018-05-30 Wed 17:30>
      In the ptp_process spec, about setting updateCorrectField condition is not clear, after disscution with tonny, TF need do modificaiton, if packet is event ptp, and allowopertion, set the updateCorrectField; don't care the egrRxIfPortNum any more. later, tonny wiil update the spec also. 
*** DONE tc_504 All port input PTP and non-PTP packet with full bandwidth.[100%]
    CLOSED: [2018-05-30 Wed 19:07]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:07]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 19:00]--[2018-05-30 Wed 19:07] =>  0:07
    CLOCK: [2018-05-30 Wed 16:21]--[2018-05-30 Wed 16:22] =>  0:01
    CLOCK: [2018-05-30 Wed 15:58]--[2018-05-30 Wed 16:10] =>  0:12
    CLOCK: [2018-05-30 Wed 15:54]--[2018-05-30 Wed 15:55] =>  0:01
    :END:      
    - [X] all egress port input full bandwidth traffic, PTP and non-PTP, disable overwrite SA on mac_tx.
    - [X] all ingress port input full bandwidth traffic, PTP and non-PTP.<2018-05-30 Wed 19:07> 
*** DONE align the related testcase form 25g device to 10g device [100%]
    CLOSED: [2018-05-30 Wed 19:24]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:24]
    - State "TODO"       from "DONE"       [2018-05-30 Wed 19:09]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 17:18]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 19:10]--[2018-05-30 Wed 19:21] =>  0:11
    CLOCK: [2018-05-30 Wed 15:41]--[2018-05-30 Wed 15:42] =>  0:01
    CLOCK: [2018-05-30 Wed 15:31]--[2018-05-30 Wed 15:37] =>  0:06
    CLOCK: [2018-05-30 Wed 15:12]--[2018-05-30 Wed 15:18] =>  0:06
    :END:      
    - [X] tc_503 
    - [X] tc_504
** DONE more details RMON test for mac_rx/tx [100%]
*** DONE all kinds of type RMON test for mac rx/tx [100%]
     CLOSED: [2018-05-30 Wed 09:32]
     - State "DONE"       from "TODO"       [2018-05-30 Wed 09:32]
   - [X] tc_207, re-prduce lab test bug. without transceiver, 64B packet with GOOD/BAD/GOOD/BAD FCS; 
  port0 input 64B packet, port1 input 200B packet; 
  port2 port3 input packet with some phy error (PCS error); 
  port4 input 128B packet with all FCS error. 
  port5 input 129B packet with all FCS error.
   - [X] tc_208, cover all kinds of type RMON for mac_rx/tx 
   - [X] tc_208a, to test RMON with MTU less 1518
*** DONE Normal traffic full bandwidth with RX input some fcs errors. [100%]
    CLOSED: [2018-05-23 Wed 15:27]
   - State "DONE"       from "STARTED"    [2018-05-23 Wed 15:27]
   - [X] with transceiver core. input packet size is 1500
   - [X] bypass transceiver core. input packet size is 1500
*** DONE Align the all related testcase between xg480_phy_25g and xg480_phy_10g device [100%]
    CLOSED: [2018-05-30 Wed 14:48]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 14:48]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 14:41]--[2018-05-30 Wed 14:43] =>  0:02
    CLOCK: [2018-05-30 Wed 14:29]--[2018-05-30 Wed 14:37] =>  0:08
    CLOCK: [2018-05-30 Wed 14:04]--[2018-05-30 Wed 14:10] =>  0:06
    CLOCK: [2018-05-30 Wed 11:59]--[2018-05-30 Wed 12:13] =>  0:14
    CLOCK: [2018-05-30 Wed 11:49]--[2018-05-30 Wed 11:50] =>  0:01
    :END:      
    - [X] tc_208
    - [X] tc_208a
** DONE Support Haidong lab test [100%]
   CLOSED: [2018-05-31 Thu 10:58]
   - State "DONE"       from "TODO"       [2018-05-31 Thu 10:58]
*** DONE generation the dyinggasp injection testcase all provisionging
    CLOSED: [2018-05-31 Thu 10:58]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 10:58]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 10:31]--[2018-05-31 Thu 10:39] =>  0:08
    CLOCK: [2018-05-31 Thu 09:48]--[2018-05-31 Thu 10:00] =>  0:12
    :END:      
    based on tc_201b, grep all procWrite.
** DONE align the testcase between xg480_phy_25g and xg480_phy_10g [100%]
   CLOSED: [2018-05-31 Thu 16:45]
   - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:45]
   :LOGBOOK:  
   CLOCK: [2018-05-31 Thu 16:14]--[2018-05-31 Thu 16:18] =>  0:04
   :END:      
*** DONE tc_201b, from 25g to 10g device, dyinggasp injection.
    CLOSED: [2018-05-31 Thu 14:04]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 14:04]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 13:58]--[2018-05-31 Thu 14:02] =>  0:04
    CLOCK: [2018-05-31 Thu 11:04]--[2018-05-31 Thu 11:28] =>  0:24
    :END:      

*** DONE tc_201c, from 25g to 10g device, dyinggasp injection, non-zero time prov.
    CLOSED: [2018-05-31 Thu 15:43]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 15:43]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 14:45]--[2018-05-31 Thu 14:49] =>  0:04
    CLOCK: [2018-05-31 Thu 14:31]--[2018-05-31 Thu 14:42] =>  0:11
    CLOCK: [2018-05-31 Thu 14:23]--[2018-05-31 Thu 14:24] =>  0:01
    :END:      
*** DONE tc_201,tc_201a; from 25g to 10g device, pause injection
    CLOSED: [2018-05-31 Thu 15:43]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 15:43]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 14:42]--[2018-05-31 Thu 14:45] =>  0:03
    CLOCK: [2018-05-31 Thu 14:25]--[2018-05-31 Thu 14:31] =>  0:06
    CLOCK: [2018-05-31 Thu 14:07]--[2018-05-31 Thu 14:19] =>  0:12
    :END:      
*** DONE tc_200, from 25g to 10g device, mac_rx/tx basic function testcase
    CLOSED: [2018-05-31 Thu 16:14]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:14]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 16:11]--[2018-05-31 Thu 16:14] =>  0:03
    CLOCK: [2018-05-31 Thu 15:57]--[2018-05-31 Thu 16:01] =>  0:04
    CLOCK: [2018-05-31 Thu 15:44]--[2018-05-31 Thu 15:54] =>  0:10
    :END:      
*** DONE tc_004a, external reset test. if it set, DUT should do nothing.
    CLOSED: [2018-05-31 Thu 16:44]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:44]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 16:32]--[2018-05-31 Thu 16:36] =>  0:04
    CLOCK: [2018-05-31 Thu 16:20]--[2018-05-31 Thu 16:22] =>  0:02
    :END:      

** DONE Lbus frame interface test for 100G mode.[100%]
   CLOSED: [2018-06-19 Tue 12:24]
   - State "DONE"       from "TODO"       [2018-06-19 Tue 12:24]
*** DONE 64 to 129 bytes size packet, each type size 200us
    CLOSED: [2018-06-19 Tue 12:25]
    - State "DONE"       from "STARTED"    [2018-06-19 Tue 12:25]
    :LOGBOOK:  
    CLOCK: [2018-06-12 Tue 08:45]--[2018-06-12 Tue 08:52] =>  0:07
    CLOCK: [2018-06-08 Fri 11:02]--[2018-06-08 Fri 11:19] =>  0:17
    :END:      
    tc_006a, 2flows, 200 and 3000 bytes; it's re-produce the lab issue.
    the issue is the lbus 's ENA is not (1 3 7 or 0xf). Leo has fixed the issue.
*** DONE 64 to 256 random
    CLOSED: [2018-06-08 Fri 17:44]
    - State "DONE"       from "STARTED"    [2018-06-08 Fri 17:44]
    :LOGBOOK:  
    CLOCK: [2018-06-08 Fri 17:18]--[2018-06-08 Fri 17:44] =>  0:26
    :END:      
*** DONE 64 to 9600 random
    CLOSED: [2018-06-08 Fri 18:33]
    - State "DONE"       from "STARTED"    [2018-06-08 Fri 18:33]
    :LOGBOOK:  
    CLOCK: [2018-06-08 Fri 18:26]--[2018-06-08 Fri 18:33] =>  0:07
    CLOCK: [2018-06-08 Fri 17:44]--[2018-06-08 Fri 17:49] =>  0:05
    :END:      

